{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.2.10.1", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_o"}, "name": "input_o", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [9, 9], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_1", "inbound_nodes": [[["input_o", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "normal_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "normal_1", "inbound_nodes": [[["conv_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "relu_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "relu_1", "inbound_nodes": [[["normal_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2", "inbound_nodes": [[["relu_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "normal_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "normal_2", "inbound_nodes": [[["conv_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "relu_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "relu_2", "inbound_nodes": [[["normal_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_3", "inbound_nodes": [[["relu_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "normal_3", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "normal_3", "inbound_nodes": [[["conv_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "relu_3", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "relu_3", "inbound_nodes": [[["normal_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "resi_conv_1_1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "resi_conv_1_1", "inbound_nodes": [[["relu_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "resi_normal_1_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "resi_normal_1_1", "inbound_nodes": [[["resi_conv_1_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "resi_relu_1_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "resi_relu_1_1", "inbound_nodes": [[["resi_normal_1_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "resi_conv_1_2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "resi_conv_1_2", "inbound_nodes": [[["resi_relu_1_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "resi_normal_1_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "resi_normal_1_2", "inbound_nodes": [[["resi_conv_1_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "resi_add_1", "trainable": true, "dtype": "float32"}, "name": "resi_add_1", "inbound_nodes": [[["resi_normal_1_2", 0, 0, {}], ["relu_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "resi_conv_2_1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "resi_conv_2_1", "inbound_nodes": [[["resi_add_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "resi_normal_2_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "resi_normal_2_1", "inbound_nodes": [[["resi_conv_2_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "resi_relu_2_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "resi_relu_2_1", "inbound_nodes": [[["resi_normal_2_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "resi_conv_2_2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "resi_conv_2_2", "inbound_nodes": [[["resi_relu_2_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "resi_normal_2_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "resi_normal_2_2", "inbound_nodes": [[["resi_conv_2_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "resi_add_2", "trainable": true, "dtype": "float32"}, "name": "resi_add_2", "inbound_nodes": [[["resi_normal_2_2", 0, 0, {}], ["resi_add_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "resi_conv_3_1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "resi_conv_3_1", "inbound_nodes": [[["resi_add_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "resi_normal_3_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "resi_normal_3_1", "inbound_nodes": [[["resi_conv_3_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "resi_relu_3_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "resi_relu_3_1", "inbound_nodes": [[["resi_normal_3_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "resi_conv_3_2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "resi_conv_3_2", "inbound_nodes": [[["resi_relu_3_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "resi_normal_3_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "resi_normal_3_2", "inbound_nodes": [[["resi_conv_3_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "resi_add_3", "trainable": true, "dtype": "float32"}, "name": "resi_add_3", "inbound_nodes": [[["resi_normal_3_2", 0, 0, {}], ["resi_add_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "resi_conv_4_1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "resi_conv_4_1", "inbound_nodes": [[["resi_add_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "resi_normal_4_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "resi_normal_4_1", "inbound_nodes": [[["resi_conv_4_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "resi_relu_4_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "resi_relu_4_1", "inbound_nodes": [[["resi_normal_4_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "resi_conv_4_2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "resi_conv_4_2", "inbound_nodes": [[["resi_relu_4_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "resi_normal_4_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "resi_normal_4_2", "inbound_nodes": [[["resi_conv_4_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "resi_add_4", "trainable": true, "dtype": "float32"}, "name": "resi_add_4", "inbound_nodes": [[["resi_normal_4_2", 0, 0, {}], ["resi_add_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "resi_conv_5_1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "resi_conv_5_1", "inbound_nodes": [[["resi_add_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "resi_normal_5_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "resi_normal_5_1", "inbound_nodes": [[["resi_conv_5_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "resi_relu_5_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "resi_relu_5_1", "inbound_nodes": [[["resi_normal_5_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "resi_conv_5_2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "resi_conv_5_2", "inbound_nodes": [[["resi_relu_5_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "resi_normal_5_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "resi_normal_5_2", "inbound_nodes": [[["resi_conv_5_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "resi_add_5", "trainable": true, "dtype": "float32"}, "name": "resi_add_5", "inbound_nodes": [[["resi_normal_5_2", 0, 0, {}], ["resi_add_4", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv_4", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv_4", "inbound_nodes": [[["resi_add_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "normal_4", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "normal_4", "inbound_nodes": [[["conv_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "relu_4", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "relu_4", "inbound_nodes": [[["normal_4", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv_5", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv_5", "inbound_nodes": [[["relu_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "normal_5", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "normal_5", "inbound_nodes": [[["conv_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "relu_5", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "relu_5", "inbound_nodes": [[["normal_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_6", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [9, 9], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_6", "inbound_nodes": [[["relu_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "normal_6", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "normal_6", "inbound_nodes": [[["conv_6", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "tanh_1", "trainable": true, "dtype": "float32", "activation": "tanh"}, "name": "tanh_1", "inbound_nodes": [[["normal_6", 0, 0, {}]]]}], "input_layers": [["input_o", 0, 0]], "output_layers": [["tanh_1", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "conv_1/kernel", "shape": [9, 9, 3, 32], "dtype": "float32"}, {"name": "conv_1/bias", "shape": [32], "dtype": "float32"}, {"name": "conv_2/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv_2/bias", "shape": [64], "dtype": "float32"}, {"name": "conv_3/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv_3/bias", "shape": [128], "dtype": "float32"}, {"name": "conv_4/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv_4/bias", "shape": [64], "dtype": "float32"}, {"name": "conv_5/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv_5/bias", "shape": [32], "dtype": "float32"}, {"name": "conv_6/kernel", "shape": [9, 9, 32, 3], "dtype": "float32"}, {"name": "conv_6/bias", "shape": [3], "dtype": "float32"}, {"name": "normal_1/gamma", "shape": [32], "dtype": "float32"}, {"name": "normal_1/beta", "shape": [32], "dtype": "float32"}, {"name": "normal_1/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "normal_1/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "normal_2/gamma", "shape": [64], "dtype": "float32"}, {"name": "normal_2/beta", "shape": [64], "dtype": "float32"}, {"name": "normal_2/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "normal_2/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "normal_3/gamma", "shape": [128], "dtype": "float32"}, {"name": "normal_3/beta", "shape": [128], "dtype": "float32"}, {"name": "normal_3/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "normal_3/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "normal_4/gamma", "shape": [64], "dtype": "float32"}, {"name": "normal_4/beta", "shape": [64], "dtype": "float32"}, {"name": "normal_4/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "normal_4/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "normal_5/gamma", "shape": [32], "dtype": "float32"}, {"name": "normal_5/beta", "shape": [32], "dtype": "float32"}, {"name": "normal_5/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "normal_5/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "normal_6/gamma", "shape": [3], "dtype": "float32"}, {"name": "normal_6/beta", "shape": [3], "dtype": "float32"}, {"name": "normal_6/moving_mean", "shape": [3], "dtype": "float32"}, {"name": "normal_6/moving_variance", "shape": [3], "dtype": "float32"}, {"name": "resi_conv_1_1/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "resi_conv_1_1/bias", "shape": [128], "dtype": "float32"}, {"name": "resi_conv_1_2/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "resi_conv_1_2/bias", "shape": [128], "dtype": "float32"}, {"name": "resi_conv_2_1/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "resi_conv_2_1/bias", "shape": [128], "dtype": "float32"}, {"name": "resi_conv_2_2/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "resi_conv_2_2/bias", "shape": [128], "dtype": "float32"}, {"name": "resi_conv_3_1/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "resi_conv_3_1/bias", "shape": [128], "dtype": "float32"}, {"name": "resi_conv_3_2/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "resi_conv_3_2/bias", "shape": [128], "dtype": "float32"}, {"name": "resi_conv_4_1/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "resi_conv_4_1/bias", "shape": [128], "dtype": "float32"}, {"name": "resi_conv_4_2/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "resi_conv_4_2/bias", "shape": [128], "dtype": "float32"}, {"name": "resi_conv_5_1/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "resi_conv_5_1/bias", "shape": [128], "dtype": "float32"}, {"name": "resi_conv_5_2/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "resi_conv_5_2/bias", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_1_1/gamma", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_1_1/beta", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_1_1/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_1_1/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_1_2/gamma", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_1_2/beta", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_1_2/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_1_2/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_2_1/gamma", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_2_1/beta", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_2_1/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_2_1/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_2_2/gamma", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_2_2/beta", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_2_2/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_2_2/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_3_1/gamma", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_3_1/beta", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_3_1/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_3_1/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_3_2/gamma", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_3_2/beta", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_3_2/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_3_2/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_4_1/gamma", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_4_1/beta", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_4_1/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_4_1/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_4_2/gamma", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_4_2/beta", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_4_2/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_4_2/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_5_1/gamma", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_5_1/beta", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_5_1/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_5_1/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_5_2/gamma", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_5_2/beta", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_5_2/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "resi_normal_5_2/moving_variance", "shape": [128], "dtype": "float32"}]}]}